export const majorCode_2021_2 = [
  {
    text: '전인교육원(전체)',
    id: 'WD0110',
  },
  {
    text: '전인교육원(공통필수)',
    id: 'WD0111',
  },
  {
    text: '전인교육원(공통선택)',
    id: 'WD0112',
  },
  {
    text: '전인교육원(자유선택)',
    id: 'WD0113',
  },
  {
    text: '전인교육원(전공입문)',
    id: 'WD0114',
  },
  {
    text: '국어국문학',
    id: 'WD0115',
  },
  {
    text: '사학',
    id: 'WD0116',
  },
  {
    text: '철학',
    id: 'WD0117',
  },
  {
    text: '종교학',
    id: 'WD0118',
  },
  {
    text: '영미어문',
    id: 'WD0119',
  },
  {
    text: '미국문화',
    id: 'WD011A',
  },
  {
    text: '유럽문화',
    id: 'WD011B',
  },
  {
    text: '독일문화',
    id: 'WD011C',
  },
  {
    text: '프랑스문화',
    id: 'WD011D',
  },
  {
    text: '중국문화',
    id: 'WD011E',
  },
  {
    text: '일본문화',
    id: 'WD011F',
  },
  {
    text: '사회학',
    id: 'WD0120',
  },
  {
    text: '정치외교학',
    id: 'WD0121',
  },
  {
    text: '심리학',
    id: 'WD0122',
  },
  {
    text: '법학',
    id: 'WD0123',
  },
  {
    text: '경제학',
    id: 'WD0124',
  },
  {
    text: '경영학',
    id: 'WD0125',
  },
  {
    text: '커뮤니케이션학',
    id: 'WD0126',
  },
  {
    text: '지식융합미디어학부',
    id: 'WD0127',
  },
  {
    text: '글로벌한국학',
    id: 'WD0128',
  },
  {
    text: '신문방송학',
    id: 'WD0129',
  },
  {
    text: '아트&테크놀로지',
    id: 'WD012A',
  },
  {
    text: '미디어&엔터테인먼트',
    id: 'WD012B',
  },
  {
    text: '수학',
    id: 'WD012C',
  },
  {
    text: '물리학',
    id: 'WD012D',
  },
  {
    text: '화학',
    id: 'WD012E',
  },
  {
    text: '생명과학',
    id: 'WD012F',
  },
  {
    text: '전자공학',
    id: 'WD0130',
  },
  {
    text: '컴퓨터공학',
    id: 'WD0131',
  },
  {
    text: '화공생명공학',
    id: 'WD0132',
  },
  {
    text: '기계공학',
    id: 'WD0133',
  },
  {
    text: '바이오융합기술',
    id: 'WD0134',
  },
  {
    text: '교육문화',
    id: 'WD0135',
  },
  {
    text: '여성학',
    id: 'WD0136',
  },
  {
    text: '정치학.경제학.철학',
    id: 'WD0137',
  },
  {
    text: '공공인재',
    id: 'WD0138',
  },
  {
    text: '스포츠미디어',
    id: 'WD0139',
  },
  {
    text: '군이러닝',
    id: 'WD013A',
  },
  {
    text: '동아시아학연계전공',
    id: 'WD013B',
  },
  {
    text: '빅데이터 사이언스(데이터분석)',
    id: 'WD013C',
  },
  {
    text: '빅데이터 사이언스(데이터엔지니어)',
    id: 'WD013D',
  },
  {
    text: '스타트업',
    id: 'WD013E',
  },
  {
    text: '융합소프트웨어',
    id: 'WD013F',
  },
  {
    text: '융합소프트웨어(인문콘텐츠융합)',
    id: 'WD0140',
  },
  {
    text: '인공지능',
    id: 'WD0141',
  },
  {
    text: '한국발전과국제개발협력',
    id: 'WD0142',
  },
  {
    text: '한국사회문화',
    id: 'WD0143',
  },
  {
    text: '교환',
    id: 'WD0144',
  },
  {
    text: '타대학',
    id: 'WD0145',
  },
  {
    text: '특별수강',
    id: 'WD0146',
  },
];
